[
    {
        "criteria": "The documents should discuss the cases of intermittent vomiting and abdominal pain in a male child. Gender non-specific results can be included, as long as there is no significant focus on female conditions such as ovarian torsion (which would be unlikely in a young child anyway). ",
        "description": "This has happened twice about 3 months apart. Literally the exact same course of events.  My son complains of pain that begins on his left side and moves toward his belly button. He asks to sit on the toilet but nothing happens. He has a high pain tolerance and this has him crying. Each time we've taken him to emergency. In the parking lot both times he vomited a small amount. Then he feels fine. The doctors see him and conform he seems ok... Check appendix etc.  send him home. He vomits once more when we get home - this time with more volume.  (again both times). Then he is completely back to normal. He has no fever and no other symptoms. He has a duplicated ureter (I'm not sure if it's his left side?) not on any medications. Any idea what this could be? Is there something I should be considering? This time he has a nasty cold but I'm not sure if he had one last time. \n",
        "title": "Looking for insight on my 5 year olds abdominal pain. 2 incidents that are odd and completely identical.",
        "topicId": "3nl0zb"
    },
    {
        "criteria": "Results should discuss the causes of blood in semen or any association between bike riding and genitourinary symptoms in a male. Results should include causes clearly associated with older men, such as BPH. ",
        "description": "\nAge: 28\nSex: Male\nHeight: 5'10\nWeight 196lbs\nRace: Caucasian\nDuration: Since last Thursday\nLocation: My sperm? My groin? My testies? I am not really sure.\n\nNo other medical issues at the moment.\nI don't have a picture of the bloody sperm.\nThis has been going on for about a week. It started off as pink discoloration, and it really freaked both my spouse and myself out when we were having an intimate moment and it came out blood red. I called my doctor but he said its normal and only to call him back if the symptoms persist for more then 10 times. I am worried though, its pretty scary.\nI have not been kicked in the groin recently, I have not had anything happen down there to cause this trauma.\nThere is no pain in my testes, there is no pain in my penis. Nothing.\nI work out regularly, I have since December, so I don't think this is a factor. I do work out very hard though.\nEdit: The problem wen't away on its own. My new bike was putting pressure on my prostate. Changed bike seats and I am as good as new.\n",
        "title": "I have blood in my semen for about a week with no other symptoms. What is causing this?",
        "topicId": "3jk2jz"
    },
    {
        "criteria": "Results should list the causes of increased leukocytes on urine dipstick, specifically including non-infectious causes.",
        "description": "My daughter who just turned 5 has been to the doctor's twice in the past 2 months with symptoms of uti. Both times she had white blood cells in her urine and we started antibiotics. Both times when we checked up on the culture, nothing had grown. Her doctor wants her back in a week to check her urine again. What could be causing this? What further avenues should we pursue if the WBCs are present next week? \nThanks in advance.\n",
        "title": "White blood cells without infection in the urine of a 5 year old.",
        "topicId": "3nlmnt"
    },
    {
        "criteria": "The results should include documents which discuss sleep disturbances during an acute viral illness, in particular an upper or lower respiratory tract infection. Results which solely discuss the use of dextromethorphan should be excluded. It is important to note that documents which highlight the potential association with a more serious condition, such as pulmonary oedema, heart failure or pulmonary embolism should be included. ",
        "description": "I have had some kind of infection for about a week now and it's morphed into just a dripping nose, chest pain and a cough. This is all something I can suffer through but I have a problem that is absolutely going to kill me if I can't solve it soon. For the last three days I have had 2 hours sleep total.\nIf I try to sleep the very moment I go horizontal or slack my head too long I am hit with a huge, rasping, painful coughing fit that lasts about 3 minutes.  \nIt makes sleep basically impossible.  I tried very hard to get to sleep in a vertical position but when I did not more than twenty minutes later my head slumped off to the side and I jerked awake coughing. \nI went to a doctor who told me to take cough syrup with dextromethorphan which I tried and even at the largest possible dose it didn't do anything. I've tried lozenges too but they don't do anything. \nIsn't there something I can do?  They say to rest when you're sick but I'm taped in a paradox of being too sick to rest! \n",
        "title": "Can't sleep due to violent coughing while laying down",
        "topicId": "3mucn2"
    },
    {
        "criteria": "Results should discuss the causes of chronic rhinorrhea. Results may also the treatment of these causes, or the treatment of rhinorrhea in general. ",
        "description": "Hi, I'm new here, and to reddit as well, and I just don't know where to turn. As of the past 2+ years, I've had this nasal drip. Now to be honest, I'm not sure if it's called a nasal drip, but I've heard it be called a bottle neck or something along those lines. The main thing is is that it's a snorting sort of deal involving the nose.\nNow, my question is, is there any way to get rid of this? It happens at any point in the day and my nose feels, for lack of a better term, congested and stuffy. But once I execute the nasal drip snorting thing, it feels better.\nI have no allergies that I'm aware of that would cause something like this, nor do I live in a location that would affect my health.\nIf anyone has ANY INFORMATION regarding such, please help, as I don't know where to turn. Thanks\n",
        "title": "Ways to deal/get rid of nasal drip?",
        "topicId": "2trr62"
    },
    {
        "criteria": "Documents should discuss palpitations caused by hyperthyroidism. Documents that discuss if the patient should seek emergency treatment for palpitations would be particularly relevant. ",
        "description": "My doctor checked my thyroid due to weight loss, elevated resting pulse, heart palps, a fluttering chest, and body aches. My TSH was 0.04 which she said was \"very low\". She is referring me to an endocrinologist to test for t4 and t3. When I looked into it, it said that thyroid storm can be fatal. I seem to have many symptoms (90+ bpm, fluttering chest, etc.) on a daily basis. Isn't waiting for an endocrinologist a risk? I left a message with their office but no one called me back yet. I called two times! Please advise.\n",
        "title": "Is this an emergent situation?",
        "topicId": "398q98"
    },
    {
        "criteria": "Documents should discuss the use of anabolic steroids in the treatment of muscular dystrophy, including documents that say there is no indication for them and explain this. Scientific papers, or research summaries, would best answer the question being asked. If no results are returned using this criteria the search should be expanded to include documents that summarise the pathophysiology and treatment of muscular dystrophy.",
        "description": "I was always curious of this question and Google and Wikipedia are not providing very sufficient answers so I figured, why not ask a doc.\nI always wondered why people, especially when diagnosed at a young age with muscular dystrophy and atrophies, were not given something to counteract the muscle depleting properties of these illnesses, like anabolic steroids?\nI saw some minimal texts about corticosteroids, but why are anabolic steroids and physical therapy out of the question when it comes to these incurable, debilitating diseases. Is there evidence that there is not clinically significant result from this type of treatment, or does it have to do with ethics of some sort.\nIf anyone has any information on this topic it would be greatly appreciated thank you!!\n",
        "title": "[Question] Why are people with muscular dystrophy/atrophy not treated with anabolic steroids and physical therapy?",
        "topicId": "2quodj"
    },
    {
        "criteria": "Documents returned discuss endometriosis and its' potential association with gastrointestinal bleeding (in particular vomiting or coughing up small amounts of blood). Any other article that discusses bleeding from other body sites during mensturation should be included, including articles that discuss clotting disorders and issues that may arise with them during mensturation. Any information such as associations, general condition information, treatment and red flags would be relevant to the person asking the question.",
        "description": "I'm a 27 year old Caucasian female, 5'6\" and 150 pounds. I live in Oklahoma.\n2 years ago, I was on my period and laid down at night to go to bed. I immediately felt like I was drowning and coughed up a handful of bright red blood. I went to the ER, where they took blood samples and did a chest x-ray. They said everything looked great and that I was healthy and discharged me with \"Idiopathic Hemoptysis\". \nThe next day, I was fine, and went about my life as usual. Then, the next time I had my period, I had the sudden urge to cough and there was the blood again. Thinking they might be related, I scheduled an appointment with the \"best gyno in town\" according to his reviews online. I told him of my issues and he said he had never heard of hemoptysis being related to menstruation. He performed a pap smear/etc and sent me on my way. I received a post card thing in the mail saying everything was normal. \nA few months later, not only was I coughing up blood, but I was also having difficulty breathing, chest pain, a strange sensation like popcorn was popping in my chest (that's the only way I can think to describe it), and a severe lack of energy to the point where I felt like I could pass out at any moment. I went to the ER yet again and they did a chest x-ray, ekg, and took blood. My ekg and chest x-ray were \"textbook\" they said, and my bloodwork showed I was in great health.\nEvery single month since April of 2013, I cough up blood during my period and only during that time. I have never coughed up blood at any other time. Sometimes it is just a little bit or a few streaks of bright red blood, other times it is darker and clotted and looks exactly like my period. My periods have gone from my typical 3-5 days of heavy bleeding to 1 day of extremely heavy bleeding and 1-2 days of light/almost non existent bleeding. \nI have not had any children. I have been pregnant once and had an abortion in July of 2012. Other than that, I have only had one other surgery and that was a tonsillectomy when I was 15. \nToday marks the first time that I have ever experienced this two days in a row. Usually it is just one day of my period, and it has always been on my worst/heaviest day. This time, I coughed up a tiny amount of blood last night during my extremely heavy day. And today, I am barely menstruating at all, but I am coughing up more blood. It is very dark, almost black in color, and clotted. I called to try to get seen today, but have an appointment scheduled for the 18th. I won't be experiencing any symptoms then, but I'm hoping someone will take an interest in my case instead of just writing me off as healthy and normal. Because coughing up blood 25 months in a row is not healthy or normal.  \nCan anyone offer any insight into my situation? I am concerned that my condition may be life-threatening, and coughing up blood is a very alarming symptom to experience. I had a chest x-ray just last month due to extreme heartburn and acid reflux which has developed in the past couple of months. Once again, the chest x-ray looked fine. I am at my wits end with this. Thanks for your time.\n",
        "title": "I have been coughing up blood ONLY during menstruation for the past 2 years. I have sought help numerous times only to be told nothing is wrong.",
        "topicId": "35ay3m"
    },
    {
        "criteria": "The results should only discuss natural therapies used to treat insomnia, mood or lethargy. Results that solely discuss melatonin should be excluded. ",
        "description": "Let's start with the basics. 22 y/o female, 5'3\", caucasian, yada yada. Lifelong insomnia, lifelong anxiety sufferer. Medication started a few years ago, treated undiagnosed depression. Still take meds to manage social anxiety. I take Cymbalta and birth control.\nI'm exhausted. Always. Every day, I'm asked, \"how are you?\" For years, my answer has always been, \"tired, but hanging in there.\"\nI recently discovered the joy of 5 Hour Energy. As soon as I take it, I'm SO happy, energized, loving my job and my work, and less anxious. Minutes prior, I was hating my job, feeling self-conscious, groggy, the whole nine yards.\nIs there a natural supplement that I can take (no, I don't drink coffee or tea, it's gross) to feel this way? Can I take 8000% of daily recommended vitamins and always feel this happy?\nKeep in mind, I've used melatonin, I've been prescribed Ambien (that made me hallucinate and made me suicidal, so had to stop). Nothing works in terms of sleep... except alcohol. Maybe I should just have wine before bed.\nRegardless, every morning, no matter what, I'm lethargcic. I have NEVER sprung out of my bed in my life except MAYBE Christmas morning as a kid. I am sick and tired of being tired. Please help.\n",
        "title": "Always exhausted. 5 Hour Energy works wonders, but I don't want to kill myself. Help?",
        "topicId": "3hl0cu"
    },
    {
        "criteria": "Documents returned should list the long term side effects of omeprazole. ",
        "description": "Since my late 20s I've had really bad heartburn. Water can give me heartburn. Bananas give me heartburn. Sometimes nothing gives me heartburn. \nUnder the direction of an ENT, I went on 40mg Omeprazole, which, taken daily, make my symptoms disappear. I'm golden. I know about the depleting calcium risk, and take a calcium supplement plus vitamin D. \nSince I haven't seen my ENT in over a year, I asked my PCP to refill my prescription. She says she's worried about my long-term use of the med and wants me to get a GI work up and EGD. \nFrankly I'd rather take the med daily. I don't know what other symptoms might suggest an ulcer, but other than the heartburn I don't have any chronic pains or problems unrelated to hormones (see below). \nI'm 34 years old, 4'11, 130 pounds, great cholesterol and BP. I have PMDD for which I take an anti-depressant; it helps a lot a lot. MEDS: I take omeprazole, calcium + D, Loestrin Lo, acidophilus and paroxatine daily. \n",
        "title": "Long Term PPI Use",
        "topicId": "36e8h1"
    },
    {
        "criteria": "The returned documents should discuss either the causes of polydipsia, how much water it is safe to drink in a day, or side effects of drinking too much water. Results that discuss diabetes mellitus, diabetes insipidus, hyponatremia and seizure risk should be included. ",
        "description": "Short info: 20, male, 190cm (6\"2' - 6\"3'), 120kg (260lbs)\nLately, I have been drinking quite a lot of water - I can't stop it, I am thirsty all the time. What do I mean by \"a lot\"? Well, on average day, it's around 5 liters, but when I have sore throat, it can be even 8-10 liters.\nIs there any risk? I know that water intoxication is a thing, but I don't feel any of the symptoms - no headaches, no vomitting.  \nThanks\n",
        "title": "Drinking too much water",
        "topicId": "38kwjf"
    },
    {
        "criteria": "The results should discuss alcohol intolerance, or medical conditions that cause flushing and gastrointestinal symptoms with the consumption of alcohol. Results that focus on conditions that occur acutely (i.e. the patient had no previous issues with alcohol consumption) would be particularly appropriate. ",
        "description": "I'm a 21 year old caucasian male in the UK. The last couple months I've really struggle to drink any alcohol without feeling immediately hot, headache and nauseous. The last 4 years of my life I've been drinking and could comfortably have 9-10 drinks (25 units) on a big night but usually I keep to 3 or 4 pints when drinking socially at he pub. However the past 2 months I've hardly been able to drink at all without these near immediate symtoms, and even if i do drink through the next day feels worse than when i used to drink big amounts when in my 18-19 fresher years. Is this common? I'm not too bothered by cutting out drinking all together, but i'm just very confused. \nEdit: I do know I've drank heavily previously and that's not good at all, but honestly it was infrequently!\nEdit: my lifestyle is healthy, I eat very well balanced diet, workout most days, play football 3 times a week and drink absolutely loads of water. \n",
        "title": "Why can't I drink alcohol anymore without feeling immediately ill?",
        "topicId": "2rc12o"
    },
    {
        "criteria": "Documents should contain information only about how long sprained ankles take to heal. ",
        "description": "I'm a 34 year old female in generally good health (5'7\", 135 lbs). On October 2, I stepped off a curb, landed wrong, and ended up rolling my ankle (inward, if that matters). I was wearing dress shoes with low heels (about 1\" if I had to guess). It hurt quite a bit and at first I thought I might have broken my ankle. Some passersby brought me some ice and called an ambulance which took me to the ER, and at the ER they took x-rays and told me that it wasn't broken. By that point the pain had nearly totally disappeared without me having taken any painkillers (even OTC). The ER put me in a knee-high stiff walking boot and crutches and I was able to hobble out of there.\nI've been wearing the boot since I left the hospital and have been surprised at the lack of pain I'm experiencing. My ankle is swollen and has just begun to show signs of bruising.\nPossibly relevant side note: About 10 years ago I had a lapidus bunionectomy on my right foot (the same side as my injured ankle) and three screws were placed in the center of my foot to stabilize the bones. My doctor tells me I have unusually flexible ligaments, which caused the bunion and foot pain. \nI've spoken to the orthopedic surgeon's office (the same one who did my bunionectomy) about my ankle and they directed me to continue wearing the boot for two weeks until I see them for a follow-up appointment.\nMy question is about recovery time for this kind of injury. I had been planning to travel overseas in early November and I'm wondering if I'll be able to walk normally by then. How long do these types of injuries usually take to heal?\n",
        "title": "Stepped off a curb and rolled my ankle. Wondering about healing time.",
        "topicId": "3nw8pi"
    },
    {
        "criteria": "The results the patient is looking for in this scenario are regarding the types of pain relief that can be used for pericarditis related pain in adults. Results that solely discuss opiate medications (such as endone, morphine etc.) should be excluded. Results that solely discuss sulfonamide/sulfa drugs, diphenhydramine, and dextromethorphan should also be excluded. ",
        "description": "\nAge: 21\nSex: Male \nHeight: 71 inches (5 foot 11 inches) \nWeight: 146lbs\nRace: Caucasian \nDuration of complaint: Three days \nLocation: (Geographic and on body): Chest, heart, back (the area directly behind the heart/lungs) \nAny existing relevant medical issues (if any): Pericarditis was diagnosed roughly seven months ago. The doctor was stumped how I got it again so quickly. I WAS diagnosed a second time this morning. \n\n-allergies: Sulfonamide/sulfa drugs, diphenhydramine, and dextromethorphan.\n\nCurrent medications (if any): Colchicine 0.6mg One tablet, by mouth twice daily (with food). Naproxen 500mg One tablet, by mouth twice daily. Tramadol inner-muscular (unknown dosage) at roughly 1:00pm central time. \n\nI'm going to keep this short. I was diagnosed with the above, and am seeking some kind of at home remedy. The internet is giving me conflicting results, and the general consensus is to seek professional help. I have already done that.\nThe problem is that I'm a former IV heroin addict of 10 years, so when I was at the hospital I declined any kind of opiate prescription. I did not take dilaudid, however was given IM Tramadol (I don't remember the dosage). Professing my history with drugs to the doctor made it so I was given nothing other than the Colchicine and Ibuprofin, however I'm in a lot of pain. \nI was advised to sleep upright, which is nearly impossible for me to do on a regular day. My major complaint is that I want to sleep but cannot. It's extremely painful to lay down, and while sitting is more comfortable, it's still not all that pleasant. \nSo my question to you guys is: what should I do at home to minimize pain? Do you think I should go back into the hospital and ask for something less addicting, like Hydroxyzine or Clonidine, or is that just a bad idea in general? All I really care about is reducing the pain enough for me to fall asleep, I don't need (nor am seeking) medication. If it can be done without, I'd be a lot happier. \n",
        "title": "Pericarditis self help/relief questions",
        "topicId": "3dh0n9"
    },
    {
        "criteria": "Results should discuss the motor tics, fasciculations or cramping abdominal pain in the context of anxiety and/or depression. The documents could contain general information about motor tics, or simply be a list of symptoms associated with anxiety or depression which includes motor tics or abdominal cramps. ",
        "description": "Age: 21\nSex: Female\nHeight: 5ft9\nWeight 170lbs\nI have had these spams for as long as I can remember, however they are starting to increase in intensity and occurrence. It mainly is just my upper abdomen that gets them and it is almost like a tourettes type twitch.  It feels similar to an anxiety attack before and after. My entire body feels tense, and I find small motor functions (such as typing) difficult. They are gotten increasingly worse, along with salt cravings. Not chips, or salty food. Literally just salt. I could eat it non stop if my boyfriend let me. It's not salt on my food, I literally go grab the sea salt box and chow down.  I drink about 2L of water a day, and we have started changing over to a healthier diet in hopes that it will help (no more candy and soda). \nI have also started to need around 12 hours of sleep to function, if I don't get that I find myself exhausted throughout the day, even falling asleep at work. I also have trouble maintaining body temperature. Sometimes I can not stop shivering no matter what. I can be wrapped like a burrito in a thick down comfort, and still be cold and shivering. \nI have been feeling a bit depressed lately, but not to the point it effects my daily life (I can still go to work/school/do things).  I also have a lot of mystery cramping through out my cycle. I do have polycystic ovary syndrome, and a copper IUD (recent). \nLet me know if I can answer any other questions. Thank you for taking the time to read this!\n",
        "title": "Full Body Spasm and Salt Cravings",
        "topicId": "3gwhon"
    },
    {
        "criteria": "Information about white skin lesions, which are not pustules, should be returned. In particular, information about face lesions should be particularly relevant. ",
        "description": "It's this next to my eye. About me: \n-  Male 44, 6'1\", 189Lbs.\n-  Peritoneal dialysis for the last two years, need a kidney transplant. \n",
        "title": "What is this white pimple like thing that won't pop like a pimple and isn't tender or hurts, also not soft like a pimple? Been there for over four months.",
        "topicId": "3nsf1p"
    },
    {
        "criteria": "Results should discuss the use of Benilyn and Tylenol concurrently to treat cold and flu symptoms. Information about drug interactions between the two, and the symptoms each one treats is also appropriate. ",
        "description": "Their doses are two each every six hours. Benilyn Extra Strength and Tylenol Extra Strength Cold & Flu.\n",
        "title": "Doctor said I can take Tylenol Cold for some symptoms and Benilyn for others, does he mean in combo?",
        "topicId": "3no3bj"
    },
    {
        "criteria": "The results should discuss instances of paresthesia and swelling of toes after being in shoes for an extended period of time. This is a difficult question to filter results for because the results will be extremely varied in nature, and any further restriction would likely return few relevant results.  ",
        "description": "Hi! So this weekend I went on a field training exercise, aka camping in combat uniforms for 3 days. I got home yesterday, took off my boots, and realized my pinky feels like it's wrapped in wax. Only the middle (horizontally) chunk seems to not feel anything thing. If it matters, the combat boots also gave me some kind of bump on my toe and also \"blisters\" on both heels (so obviously they're not comfortable). It is still numb today, should I be concerned, or would it likely go away in a few days? Thanks! (Btw, it's also very slightly swollen, and is a red)\n",
        "title": "Pinky toe numbness",
        "topicId": "338bbh"
    },
    {
        "criteria": "Information should discuss the different treatment modalities, including risks and benefits, for hypothyroidism. ",
        "description": "EDIT: Forgot to add that she is Caucasian\nAs the title says. Also she believes this issue was caused by the birth control she was put on, which caused her metabolism to slow down for \"the baby\".\nShe is upset because the doctors did not tell her this and after it happened they said there are meds we can put you on but we wont at your age because they are highly addictive, they also told her that the way her metabolism and the thyroid issue is, she will not lose weight even if she starves herself for 2-3 weeks.\nShe is really upset because the doctors will not give her the medication she needs. She is a very happy person otherwise and does not want to tell doctors it's making her depressed because she does not want it on her record.\nI just want to know if there are any other options we can try? Anything natural or OTC before she has to be put on these meds? She has already tried all the OTC metabolism boosters and she has taken accelerated B12.\nThank you for your help! \n",
        "title": "My girlfriend (22y.o./5'7\"/182lbs) has a thyroid problem causing her metabolism to be severely low (around 32 she says normally it was up around 150), docs will not give her medication until shes 30 due to meds being highly addictive.",
        "topicId": "3j3rz2"
    },
    {
        "criteria": "Results should address one of the following three topics: causes of a raised AST, the effect of recent alcohol consumption on AST, and/or transient elevations in AST. ",
        "description": "On Saturday I had a lot of abdominal discomfort to the point where I suspected appendicitis. I went to the hospital, went through the tests and was told that it was really just constipation (I spent the majority of yesterday getting it out). \nWhat's a little more worrisome was what came up on my blood test. My ALT was way higher than normal (112) for my age (28), and the doctor asked me if I drink. When I said I did, he told me to stop immediately.\nI do drink, but I would not say that I drink excessively. I don't drink alone, I don't drink anything but beer and I certainly don't drink every day. I'll admit that probably one day out of every weekend I might have in excess of six beers, but that doesn't seem to me like problem-level drinking. This is also a fairly new development; before the last couple of years I didn't drink more than once a week.\nNow, I understand that denial is part of alcoholism and I'm willing to work on that as well, but there's a few things I'd like clarified that the doctor didn't / wouldn't answer:\n1) How bad is 112, really? How much of that damage is irreversible?\n2) I had been out the night before - had some wine with dinner, then about five pints over the course of the evening. Could that have had any bearing on skewing the numbers? I would say the blood tests happened 12 - 16 hours after I had been drinking.\n3) What else could fuck my liver up (maybe in conjunction with the drinking)? I'm the heaviest I've been in a while (6', 215) but as I understand it this is something that could've happened over time.\n",
        "title": "Question about biochemistry results regarding liver",
        "topicId": "338c8r"
    },
    {
        "criteria": "Documents returned should specifically discuss the meaning of the phrase \"Benign penile skin showing mild lymphocytic infiltration with marked nuclear crush artifact.\" No other document would be suitable to answer the question. Results that simply discuss the meaning of the phrase \"Benign penile skin showing mild lymphocytic infiltration\" are acceptable. ",
        "description": "So I got the results back on a sample of skin they biopsied looking for evidence of HSV. My lab results say the following:\nBenign penile skin showing mild lyphocytic infiltration with marked nuclear crush artifact.\nCan someone interpret what that is exactly for me, please? The nurse didn't understand the results either, and I haven't heard back from the doctor yet.\n",
        "title": "Need help interpreting my biopsy results",
        "topicId": "3mwih0"
    },
    {
        "criteria": "Results should list the causes of a long term sore throat in a adult. This is a general question and likely to return many results, but it is difficult to narrow down further. ",
        "description": "Age: 21\nSex: (Trans woman, it should be obvious)\nHeight: 6ft/184cm\nWeight: around 80 kilograms.\nRace: White (Dutch, bit of french and bit of belgium to be specific)\nDuration of complaint: Since around the end of April.\nLocation: Tonsils/back of the throat. (The Netherlands)\nAny existing relevant medical issues: No\nCurrent medications: Cyproterone acetate 50mg once a day and estrodiol progynova 2mg twice a day.\nOkay so I've been having this pain in my throat and overal head for about half a year now, it's usually in my throat and it's usually red. Sometimes it's not very painful but sometimes it's really painful. I've been to my house doctor SEVERAL times and according to him it's a viral throat infection. But it doesn't just affect my throat, it also affect my eyes, they get very irritated and sometimes really red when I rub then, my head sometimes also hurts sometimes, headaches and stuff. Nothing of this is really holding me back from doing stuff but I'm sick of the constant discomfort. \nI also sneeze a lot when I have pain in my eyes, there's nothing wrong with my vision however. My girlfriend said it's probably an allergy because my room hasn't been cleaned in the longest time and it's really dirty and dusty, so I could believe that. Anyway my doctor recommended me to drink paracetamols crushed up (two of them) along with warm water and a lemon squeezed in it, oh and gargle it aswell. Now I haven't been doing this for longer than 2 days straight at best in a row because it's just disgusting but he told me to do it for about a week, and also drink honey and thee and stuff.\nAnyway this is all I can think of, if there's anything else I can specify let me now. This has been very frustrating and I want it to end.\n",
        "title": "Viral throat infection, according to my house doctor.",
        "topicId": "3n4kb2"
    },
    {
        "criteria": "Documents returned should talk about the different methods of analgesia for the removal of anal skin tags, or post-procedure recovery / pain for anal skin tag excision. Case reports or patient information material would be useful in this case, and likely return an adequate number of results. Prevalence, diagnostic criteria, and general management options are likely not appropriate to answer this query. It is unlikely that a general anaesthetic would be recommended in this case, and hence results that discuss this should be excluded. ",
        "description": "I have several painful anal skin tags. My doctor told me he could remove them in the office with lidocaine to numb the area. He says it's no big deal, but everything I have read online says it is an incredibly painful recovery and that the lidocaine shots are horrible. Is this true? Should I insist on general anesthetic? How bad is recovery?\n",
        "title": "Anal skin tag removal",
        "topicId": "3nms1l"
    },
    {
        "criteria": "Documents should discuss multisystem diseases that are difficult to diagnose. The document should discuss symptoms of a condition, and these symptoms should include one of: paresthesias, dizziness, balance impairment, shortness of breath, palpitations or fatigue",
        "description": "EDIT:  Formatting and clarify list - plus medical history at bottom\nAny ideas on what to have our doctors look into would be greatly appreciated.\nMy wife has been experiencing these symptoms for many years, but in the past 2 years they have become significantly worse in both frequency and intensity.  We have seen several doctors but they all are at a loss and seem very unconcerned since none of her symptoms are particularly terrible - however, they are pretty drastically affecting her daily life.  If anyone has any idea about things to look into and ask her doctor about, we would be forever grateful.\nShe's 27, 5'3\", 120 lbs.  White, southern california, no current diagnosed issues and no medication.  Up until this last year, when she hasn't been able to because of symptoms, she was very active.  Gym 2x/week, and she dances and choreographs for a living.  She still choreographs and is fairly active despite her difficulties, but less so than before.\nSymptoms:\n\nNumbness in fingers, nose, and lips when active or resting (comes and goes, but happens a few times a week and can last all day)\nFeeling faint and dizzy (but has not actually fainted) when active or resting\nShortness of breath\nIrregular heartbeats (she says it feels like it pauses, and then \"ker-thumps\")\nExtremely tired and fatigued (about 80% of the time)\nFrequently losing her balance when active or resting (she says she feels like she loses her balance sometimes when she's sitting or laying down, which is odd)\nFeeling \"hazy\" in her body\nHeartbeat often slow when she's physically active or very fast when she's resting\nThough she is often sleepy, she sometimes has trouble sleeping through the night or falling asleep - takes melatonin or Zzzquil on occasion, which helps.  Maybe 2x a week for the past 2 months. Not sure if relevant.\nVery frequent muscle twitches - especially in left eye and in fingers\n\nThings the doctors have checked:\n\nBasic blood work - she's not anemic, her electrolytes are normal, not diabetic, and anything else that would come up in that test was normal.  Vitamins B and D were good.\nThey gave her an event heart monitor for a month - the doctor thought there may be a structural issue with her heart.  She recorded several episodes but they all were deemed normal and not a heart problem.\nHeart echo (ultrasound) - normal \nEKG and stress test - monitored her heart at rest and on the treadmill, normal\nblood pressure, heart rate and breath rate are all within normal range - we have a blood pressure doodad at home and tracked it throughout the day for a couple months, as well as checking at every doctor visit - all normal\nMRI to check for seizures or unusual brain stuff, normal\ngiven anxiety medication by the neurologist that did not help, went to see a psychologist who did not think she was anxious or had any other mental issue\ntried cutting caffeine from her diet, eating very healthy, doctor had suggested more salt in her diet (?) so we tried that for a while, she drinks plenty of water every day, and keeps her sleep schedule regular (though often so tired/fatigued that she naps during the day as well)\n\nDoes anyone have any suggestions about things to look into at this point?  We don't know what else to ask the doctors about, and none of our friends and acquaintances have any ideas.\nThank you so much.\n\nNot sure if relevant - she and her twin were born very early, given steroids before even born to fully develop their lungs.  Both her brother and her sister have asthma, though she was never diagnosed with it.\n\n",
        "title": "My wife has mild but worsening symptoms that our doctors can't diagnose",
        "topicId": "247m3y"
    },
    {
        "criteria": "Results should discuss links between cognitive intelligence and mononucleosis (or dexamethasone). It is likely that few results will be returned.",
        "description": "Hey Reddit,\nI don’t necessarily have a problem or a condition; I just want some insight from people more educated than I. \nA few years ago (freshman year of college) I got mono and was subsequently hospitalized. I had a high fever, incredibly swollen tonsils, lymph node swelling, etc. They put me on a course of steroids and pain medication and kept me in the hospital for about two weeks. I didn’t eat much at all during those two weeks because I couldn’t stand the pain of swallowing. I would have some ice cream and some yoghurt occasionally but not much else. I was also basically bed-ridden and only got up to stumble to the bathroom.  When they discharged me I could barely walk because I’m assuming the muscles started atrophying in my legs due to lack of use and lack of nutritional protein. I also had lost almost 20 lbs. \nAfter I was discharged, I recovered in my dorm room for the next week or so but still didn’t go to class. So in all I missed about 3.5 weeks of classes and midterms were approaching. It was my first semester of school and I didn’t want to get behind academically so I thought I would do my best to make up the work and take the midterms with everybody else. Well surprisingly I studied and almost aced the midterms. And for the next two weeks everything academically seemed a lot easier. My ability to concentrate, absorb material, and understand new concepts was vastly improved. Eventually these abilities went away and I was back to my normal self. \nWell I’ve always wanted to feel that way again. Here are my thoughts on what could have caused the change:\n1)  The diet of strictly yoghurt (and a little ice cream) drastically and positively altered my microbiome.\n2)  3 weeks of caloric restriction caused many changes in my body including reducing inflammation and body fat percentage and altering hormones and probably many other things.\n3)  3 weeks without anxiety and worries unrelated to my illness. While I was in the hospital I was pretty relaxed and really didn’t have to worry about much. I was pretty confident that I was going to recover. \n4)   The heavy course of steroids that they gave me reduced bodily inflammation and did tons of other things.\n5)  Some combination of the above\nAny thoughts or suggestions?\nTldr: Mono made me smarter\n",
        "title": "Mononucleosis and cognitive boon",
        "topicId": "3nugjs"
    },
    {
        "criteria": "Results should discuss the causes of blood in semen or emergency presentations that may present with blood in semen. Results should be specific to a young male. Side effects of the drugs Methocarbamol or Ibuprofen should be included if they have been shown to be associated with blood in the semen.",
        "description": "My significant other had what he thought was a pulled muscle in his back on his lower right side yesterday morning. It was excruciating, and muscle relaxers (Methocarbamol) along with a healthy dose of ibuprofen helped but did not completely relieve the pain. Any sort of bending, twisting, or sitting made the pain worse, and it stretched from the back to his testicle and leg. \nThis morning he noticed that his right testicle was a little bit swollen, but he needed to go on a work trip for one week (staying home not an option). This afternoon he vomited from pain, said that wearing a lumbar support belt did alleviate the pain somewhat, and that wearing tighter boxer briefs made it feel better. He masturbated this afternoon, and the semen was bloody, but he said it made the pain much better. He does not have a fever, but was sweating a lot yesterday. The pain started when his daughter jumped on his back yesterday morning, which began what he thought was him tweaking his back- now he's wondering if it's actually something going on with his testicle that is radiating to his back?\nStats: 35, Male, 6'5\", 265, Caucasian, 36 hours of pain; does not have other medical issues, but has been treated in the last week for reflux (is currently on Prilosec). If it is relevant, I have recently had high levels of vaginal strep that are being treated with boric acid.\nThis is not a matter of him going to the doctor. He will go. His work trip has him out until Friday, so I'm curious as to whether this is something that requires immediate attention, or if it's something he can do once he gets back. Obviously I'd be freaking out if I were a guy and there was blood in my semen, but he seems a little less worried than me, which is why I'm posting here. We appreciate any help you can give. Thank you. \n",
        "title": "Lower back pain and blood in semen",
        "topicId": "2w4wpx"
    },
    {
        "criteria": "The patient is specifically requesting information to relieve pain for compartment syndrome where surgery was not performed. Results here should discuss conservative management of compartment syndrome. Limiting the results simply to analgesia may would likely overly restrict the number of results. ",
        "description": "32 yo male, no medical issues except for psychiatric issues. two weeks ago I was hit by a car while crossing the street and hurt my left leg. i went ot the hospital and the x rays were negative. then a few days later I had this awful awfu l unbearable pain in my leg and it was going numb and tingly and I could barely move it at all. i went back and they diagnosed me with acute compratment syndrome or whatever. They said it was a huge medical emergency and I needed to be admitted for rapid surgery. well the hospital wouldnt let me undergo that surgery because my insurance wont cover it. So now it's four days later and my leg is still causing me so much pain. how do I manage this? Oxycodone isn't doing a damn thing.\n",
        "title": "diagnosed with acute compartment syndrome",
        "topicId": "38j4of"
    },
    {
        "criteria": "Documents should either discuss the clinical course of Alzheimer's disease, or the most common causes of death for those with Alzheimer's disease.",
        "description": "I understand the disease shuts the body down, but what would be the actual literal cause of death?\n",
        "title": "How is it possible to die from Alzheimer's Disease?",
        "topicId": "2yw48d"
    },
    {
        "criteria": "Results should discuss the association with between previous cathers and painful errections. Results that only discuss the issue in the context of older men, or children should be excluded. ",
        "description": "I had surgery on December 15, 2014 and had a Foley Catheter for about 5 days. During that time they took out my catheter, but I was unable to urinate because the epidural I had blocked my ability to pee. To my horror, they had to reinsert it, but this time I was awake.\nAfter getting out of hospital, I had pain during my erections when my penis laid flat on my stomach. The pain was inside and at the base of the penis. I did not have any pain when urinating or when my penis was flaccid. Although it probably wasn't the best idea, I did masterbate during this time because the pain only happened when my penis was in a certain position. I went to my doctor and he said it was just bruising from the catheter and that it would go away. \nIt's been about 2 weeks since I saw my doctor and recently the pain has gotten worse. I first noticed the progression when I tried to masterbate. My erection was slightly painful and attempting to masterbate hurt so I stopped. Since then I haven't had an erection but I'm pretty sure that my pain is not from bruising since it has gotten worse. I'd like to reiterate that I only have pain during erections, none during urination or when flaccid. \nI'm planning on seeing my doctor again but I was wondering if anyone has any idea what could be wrong? When searching online I couldn't find any type of infection that only causes pain during erections.\nEdit: I'm a 17 year old male, 125 lbs, and 5'11\".\n",
        "title": "Painful erections a month after having a Foley Catheter.",
        "topicId": "2sp7xd"
    },
    {
        "criteria": "Results should discuss treatment for traveler's diarrhea that has persisted beyond three days. Results that discuss analgesia for upper abdominal are particularly important to this patient. ",
        "description": "Male, 22, 6ft 2in, 17.5 stn, strong build, Caucasian, 3/4 days of severe pain now, top of stomach below sternum, UK, no other medical issues. \nSo I have experienced discomfort when I eat since I can remember. I always become heavily bloated, flatulent, and my stools are often very soft with a little bright red blood. I was assured the blood was not an issue before as it was thought to be an internal pile. \nHowever I was on holiday for a few days with my gf and when I returned last Friday I had a pain in my gut. I thought nothing and went to bed. However when I woke up i was in severe pain along the top of my stomach. My bowel movements completely stopped and anytime I ate anything my stomach felt like it was tearing itself apart. It has been like this all weekend. Food poisoning would probably have subsided a little by now and constipation is not the answer as I have passed very wet stools 3/4 times today already, with no relief. \nMy mind immediately jumps to ulcer or pancreatitis brought on by the few days of poor diet while I was away, yes there was alcohol involved but nothing major. \nI have tried calling for a gp appointment but they are fully booked this week, any thoughts while I wait for an appointment?\n",
        "title": "Severe abdominal pain with history of gastrointestinal discomfort. Thoughts?",
        "topicId": "3nkiyp"
    },
    {
        "criteria": "Documents returned should discuss how blood pressure should be reduced during a hypertensive crisis. Specifically it should discuss the maximum rate of blood pressure reduction (i.e. how fast it should be reduced). ",
        "description": "Hi, I'm an ER nurse and I have a question that might possibly be dumb or I should already know this...so I had a (younger) patient who came in for unrelated issues with a history of strokes from HTN. Their blood pressure was 260 systolic, the PA wrote for oral clonidine to bring it down. I was asking another nurse why PO and not an IV med and they were like, oh you don't want to drop the blood pressure too fast if they are used to it being that high. At the time I was thinking, yeah that makes sense. But now that I'm thinking about it again I really don't understand why...what will happen if the blood pressure is suddenly dropped into a more normal range? A Bp of like 180 systolic wouldn't have issues with perfusion even if they were used to way higher would it? All I can think is maybe they would feel crappy, but at least they wouldn't be at a risk for strokes with a crazy high blood pressure. The patient was asymptomatic, but the history of MULTIPLE strokes made me feel really nervous about it. I don't know, am I missing something here?\n",
        "title": "Blood pressure question",
        "topicId": "3mfthg"
    },
    {
        "criteria": "Documents should only be included if they contain a list of side effects of Effexor, or specifically discuss the risk of (or lack of risk of) tinnitus and balance disturbance when taking Effexor. ",
        "description": "A few months ago I stopped taking Effexor and no longer experience these side effects, but I'm curious what had caused them, I'll be grateful if someone could tell me what made me feel like this and perhaps recommend some further reading on the subject.\nI felt physically out of balance, I never stumbled or walked in a zigzagging pattern, but I felt like I had to be very careful walking, like I was wearing stilts. I also had to keep my eyes fixed on one point in front of me while walking because when I turned my eyes or head I got very disoriented for a moment and I felt this kind of... buzzing in my ears (I don't know if this works for everyone, but I can hear the same buzzing when I try to look up as much as I can without moving my head). The symptoms would come and go and they varied in intensity. When I weaned off Effexor, they gradually went away.\nI don't know if this is relevant, but just in case: I'm 23, female, caucasian, 165 cm/55 kg.\n",
        "title": "I'm curious about the cause of a medication (SNRI) side effect that I used to have (dizziness when moving eyes, etc)",
        "topicId": "3bc73e"
    },
    {
        "criteria": "There are two questions that need to be answered by the results returned. The first would be answered by documents which list the symptoms of a hydrocele. The second would be answered by a document that discusses the causes of painful scrotal swellings (especially if they are associated with vomiting).",
        "description": "Age: 30\nSex: M\nHeight: 6.0\nWeight 160\nI was told that I have a hydrocele at an urgent care a few months ago.\nI have scrotal swelling. (My right testicle is the size of a grapefruit.) I just also have a sore back, abdominal pain, nausea, vomiting, and the occasional fever.\nThe pain worsens and gets better. The pain is dull and throbbing. Heating pad helps with back. Haven't found anything for testicle or abdomen other than avoiding most solid foods which I tend to throw up. Whenever I walk around, it's remarkably slow and I walk like I am in pain. i tend to lie down.\nAre these symptoms possible with a hydrocele? Is it likely that I have something else?\n",
        "title": "Swollen Testicle and Sore Back",
        "topicId": "3dbs5z"
    },
    {
        "criteria": "Documents should discuss weight loss that occurs because of thyroid conditions, especially hyperthyroidism. In addition results which discuss causes of goiter and their association with weight loss should be included. Limiting the results to the specific history of the patient (previous hemi-thyroidectomy) would likely return improper results, in particular results that discuss acute surgical complications. ",
        "description": "Age:29\nSex:Male\nHeight:5'9\"\nWeight:135.5 lbs\nRace: Caucasian\nDuration of complaint: 2 Months\nLocation: Weight loss\nAny existing relevant medical issues: Right side thyroid removed in May of 2014\nSo I previously had half my thyroid removed because it was the size of a golf ball. My Endocrinologist said everything was fine, my left side was compensating well. But, in the last month I feel like I've lost a lot of weight, going from around 143 to 135. I am still making an appointment with my doctor, but my girlfriend is very worries so I figured I'd ask here.\nIs it possible that something with my thyroid is causing the weight loss? \n",
        "title": "Hyperthyroid question",
        "topicId": "3nxghh"
    },
    {
        "criteria": "Documents should discuss the prescribing habits of general practitioners in regards to opioid pain medications. Acceptable results would also include those that discuss common reasons opioids are prescribed in primary care. ",
        "description": "So from what I'm gathering, people with chronic pain are having a problem getting any opiods as doctors are neglecting to prescribe them? Even if you get a referral to a doctor by relative chances are if they're giving out pain medication they are no longer accepting new patients? Can someone elaborate on this?\n",
        "title": "Doctors afraid to give out pain medication even for people who need it badly? What's going on?",
        "topicId": "3j2cj9"
    },
    {
        "criteria": "Results should discuss the types of discharge that can occur from a female nipple and the potential causes of the different types of discharge. ",
        "description": "\nAge: 24\nSex: Female\nHeight:5'8\"\nWeight: between 61-65 kg\nRace: White (Ashkenazi Jewish - may be relevant)\nDuration of complaint: Smelly white, yellowish discharge for several years, bloody discharge is from today only. \nLocation (Geographic and on body): Right breast only.\nAny existing relevant medical issues (if any) : Celiac disease, endometriosis, ovarian cysts, hysterectomy at 19, multiple surgeries. \nCurrent medications (if any):None. Naproxen for pain occasionally. \n\n\nI believe that covers the relevant information. Today I noticed that I had some dried blood from the opening of the nipple and from the side where I had a nipple piercing as a teenager. I usually have a rather smelly white discharge from both nipples that expresses when squeezed, but it has never been bloody. I squeezed the right nipple and more blood (very small amount) came out along with small clots. There was no noticeable odor but it was alarming as breast cancer and non-cancerous clots/nodes run in my family (maternal Jewish side, paternal side is mostly unknown)\nI performed a self breast exam, but I cannot tell either way whether what I was feeling was normal tissue or not. I had a mammogram at 16 when I was leaking copious amounts of fluid from the same breast, but nothing since then. I tried to do the exam as they instructed but I guess I don't know enough to tell the difference. \nI have had one live birth at 19 and shortly after I had a hysterectomy, removing all except my left ovary (cervix, uterus, right ovary are gone) I did not breastfeed. \nI am not on HRT or any type of medication. I have menopausal symptoms but also have the signs of a \"period\" each month (breast tenderness and swelling, lethargy, emotional sensitivity.) \nI am unsure if I am counted as post-menopausal since I still have the hormonal cycle each month, but I do have hot flashes and all of the other complaints most older women have, so I do not know if I need to be having mammograms every year. \nIs there anything benign that this could be? Can I wait the few months until my insurance begins or is this something I need to see someone about immediately? Is there anything I need to look out for?\nThank you for your time. I appreciate it very much. \nI moved to a country where I do not have insurance, and won't until June at the earliest. I am currently unemployed and due to the nature of this country's health care system, I need an insurance provider to be referred to anything other than an urgent care clinic. You cannot schedule doctor appointments on your own.\n",
        "title": "[F, 24] Bleeding and discharge from right nipple with small clot. Not insured, post hysterectomy (~5 years ago)",
        "topicId": "3167of"
    },
    {
        "criteria": "The patient is specifically requesting information about testing for Herpes Simplex Virus and how it is transmitted. Results that contain background information about the condition should also be included if they discuss transmission and testing. ",
        "description": "Hi r/AskDocs,\nI am a male, 25, 71kg, 5'9, Black. 5 days ago, my face started feeling funny. I couldn't completely control one side of it. Went to see a doctor, and I have bell's palsy. It is very annoying, and hopefully this isn't permanent. I have an MRI scheduled on Tuesday. \nWhat I don't understand, is the fact that the doctor gave me something for herpes. I did some digging, and apparently Bell's palsy has something to do with herpes. Now, I have no idea how I possibly could have caught herpes. The closest my penis has ever been to a vagina was during my birth, I have never had sex, let alone unprotected sex. No sexual activity whatsoever, and I currently have no interest in it. \nIf I'm not mistaken, herpes is detected by checking one's blood, am I correct? I donated my blood a few times in 2013 and 2014, they sent me a letter asking me to please donate more, got checked for STDs (they only took my blood, didn't take a look down there), spent 4 days in ICU earlier this year (miopericarditis) where they kept taking blood samples, and nobody has ever told me I could have herpes. How could I possibly have caught herpes? This seriously baffles/terrifies me. \nHowever, I have recently learned from my sister that my mom has herpes  (on her butt apparently), we share a bathroom and I'm terrified that I could have somehow gotten it from her.\nThank you for your help   \n",
        "title": "I currently have Bell's Palsy. Does that mean that I most likely have herpes?",
        "topicId": "3gdnde"
    },
    {
        "criteria": "Documents should discuss ethical issues involved with organ donation, and that any reports that highlight treatment differences in patients who are known organ donors. ",
        "description": "",
        "title": "I know I'll probably catch hell for this but is there any truth to the myth that doctors or surgeons will do less to keep you alive if you are an organ donor?",
        "topicId": "3iv0gl"
    },
    {
        "criteria": "Documents should discuss the risk factors for bacteremia and sepsis. Results should be limited to documents that specifically discuss skin abrasions and seeding through the gastrointestinal system. General information about species, including treatment, is not appropriate to answer the question.",
        "description": "",
        "title": "Is it possible to become bacteremic if your anus starts bleeding when you're wiping? If so, how likely is this to occur?",
        "topicId": "3jic54"
    },
    {
        "criteria": "Acceptable results include a summary of Guillain-Barre Syndrome or a description of the clinical course of the disease. ",
        "description": "He had the flu last week and did not go to the doctor when he started experiencing tingling limbs. This morning he woke up unable to walk or move his arms. My husband and I took him to the ER and after hours of tests he was diagnosed. He is 59 years old and already has Bell's Palsy in the left side of his face from an earlier nerve issue. \nUpdate: He is having trouble breathing and will be put on a ventilator tonight.\n",
        "title": "My father in law was diagnosed with Guillain-Barre Syndrome today. What can we expect?",
        "topicId": "2s7f67"
    },
    {
        "criteria": "The documents should discuss the accuracy of Hepatitis B serological testing, including the false positive rate and what might interfere with the results.",
        "description": "I had a cold and i donated blood. Is it possible that me having a cold could have interfered with the test? I am showing no symptoms and calling the doctor tomorrow. I just want to know so I could stop freaking out.\nAge: 18\nSex: Male\nHeight: 6'6''\nWeight: 180\nRace: Caucasian \n\n",
        "title": "The blood i donated tested reactive to hepatitis b?",
        "topicId": "2whsqk"
    },
    {
        "criteria": "Documents should discuss the association between high TSH and/or low iron and fatigue and/or recurrent skin lesions (rash). The question the results must attempt to answer is multifaceted and contains the results of laboratory investigations and a number of symptoms, hence a broad variety of results are acceptable. ",
        "description": "Hi there. The patient (daughter of my best friend), has been sick in various ways since the beginning of the year. At first it seemed like an extended cold or flu, which included an ear infection, for which she took antibiotics. There was also a household dosing of Combantrin, because of worms in another family member. There is a slight possibility of swallowing river water. Patient is female, five years old, average height and weight, Caucasian, no medications, no history of medical complaints prior to this year, very healthy diet, usually very active (other than for the past few weeks, due to fatigue). \nCurrent symptoms as follows:\n\nPersistent lethargy. Much reduced energy levels.\nSlightly swollen lymph glands. They were very swollen when she had the cold or flu.\nBloating after eating, especially when food has higher sugar content (porridge with added honey, yogurt).\nPain in stomach area, especially after eating. \nReduced appetite. Not greatly reduced, but definitely some reduction. \nIntermittent appearance of hives, about once per month. Sometimes they have covered her entire body. Local doctor said likely food reaction, but was not sure. \n\nBlood tests were done on the basics. Most things came up normal, but several were abnormal, without a clearly related pattern (for us). Abnormal blood results as follows:\n\nGlucose - Low - 3.1 \nIron - Low - 4.0\nC-reactive protein - High - 9.5\nTSH - High - 7.3\nMonocytes - High - 1.0\n\nIf anything occurs to you I'd appreciate hearing it. Thank you for your time. \n",
        "title": "5-Year Old Girl, Puzzling Symptoms & Blood Tests",
        "topicId": "2czo83"
    },
    {
        "criteria": "The question the user is asking here is very broad, and hence a wide variety of results are applicable. Acceptable results should discuss conditions, or a list of conditions, that cause chronic gastrointestinal discomfort (nausea, vomiting, constipation etc.). Results that discuss the side effects of medications are also acceptable if they include: clonazepam, hydroxyzine pamoate, or ranitidine.",
        "description": "We've been to different hospitals/doctors so many times now, it's frustrating and expensive because we leave without any answers. My wife is missing so much work (she's now on FMLA) but we're losing so much income because of it\nFemale, 34, 133.6lbs (she lost 10lbs), 5ft5in, caucasian, Midwest US, stomach region (center, left and right)- her stomach gets bloated and looks like she's pregnant and her stomach is hard and tender (this happens anytime- not just after eating) She has nausea, vomitting, diarrhea, constipation, acid reflux, pain at the bottom of her rib cage.\nEvery time we go to the ER, they'll give her some meds for the pain and maybe take an X-Ray or Cat Scan and then tell her it's IBS and to eat gluten free.  She's been eating a strict Gluten free/IBS diets for a month and it's not getting better. The last time we went to the ER (4 weeks ago), they scheduled her with a new  gastroenterologist and was scheduled to see him a week ago but they called her and told her that he does not feel he needs to see her to give her a second opinion- this happened 10 minutes after she walked out of her original gastroenterologist who told her that since she is going to be seen by another gastroenterologist, she doesn't want to do anything with her. She called her original gastroenterologist after she got the call telling her she won't be seen by the other one- but she won't be able to be seen until September 23rd. \n\nShe had a colonoscopy in June of this year and nothing was found\nLast year  she had these same issues and after going back and forth to different doctors, they determined it was her gall bladder and they removed it- after they did, most of her issues went away (vomiting, upset stomach) but then they slowly came back and are back with a vengeance \nLast year, they gave her an endoscopy and found a 1/2 centimeter hiatal hernia but weren't/aren't concerned about it. She did not have an endoscopy this year\nHer white blood count has been at an 11 since last year but the doctors weren't/aren't concerned about it\nEvery once in a while, she'll poop blood (fresh blood most of the time) (doctors weren't/aren't concerned) (Have a picture if needed)\nThey found a cyst on her ovary the last time we were at the ER and it popped about 2 weeks ago \nShe smokes cigarettes (a pack a day since she was 14) (she has patches to help her quit but she's scared to use them right now because she uses the cigarets as a crutch to help her calm down)\nShe smokes marijuana daily and it helps with the pain but doesn't take it away\n\nEDIT: She was tested for celiac disease and came back negative\nMeds she's currently on:\n\nHydroxyzine Pamoate 25MG 1 capsule 3x's/day\nOndansetron ODT 4MG Tabs 1 tablet every 8 hours as needed\nClonazepam 1MG Tab. Take 1 tablet at night for sleep\nRanitidine 150MG tabs. I tablet 2x's/day\nShe takes cough medicine (OTC) at night to prevent her from coughing in the middle of the night\nAlign (OTC)\nCentrum (OTC)\n\nWe are at our wits end right now. I am dying inside because I can't help her. I see her suffering and there isn't anything I can do to take this pain away. This is why I am coming to you and hopefully, somebody can shed some light or even give us direction on how to get treatment ASAP. \nDo we go to the ER and tell them we want certain tests that weren't done before? Do we have to wait it out until her next appointment with the gastroenterologist in over a month? \nPlease help\n",
        "title": "My wife has been having serious stomach pains and cramps, nausea, vomiting, diarrhea... they (hospital and PCP) are calling it IBS but we think it's something more. Can somebody please help us and tell us what our next steps should be?",
        "topicId": "3g4fiy"
    },
    {
        "criteria": "Results should discuss eye strain associated with excessive use of computer screens. Results that discuss why visual loss, dry eyes or headache might occur when using a computer are also acceptable results. This is a general question and likely to return many results, but it is difficult to narrow down further. ",
        "description": "Hi. I'm a 23 year old female. \nToday, while on reddit, I started encountering difficulties reading. I first noticed this as I was reading a large block of text. It was like some of the letters were sort of disappearing... the letters to the right of the ones I was currently reading. Thinking that it must be the strain of reading from a screen, I tried looking at other things, like my arm and a book. I noticed there's a blurry spot in my vision, just to the right and down from the centre of my focus. It was more like an elongated patch than a round spot... an area of wriggly lines, like static on tv.\nI was also experiencing a slight headache. I'd had this headache yesterday as well but it wasn't there when I woke up this morning. It had started again after I got on the laptop. Not much pain and there's also a slight feeling of pressure. \nI tried looking around at objects at varying distances but the blurry area was still there. I tried closing one eye and then the other, but it was there and at the same location (slightly to the right and slightly down as I mentioned earlier). \nI googled this and found that it could be a symptom of all kinds of things, from macular degeneration, retinal detachment to severe depression. I've been going through a pretty rough phase right now and reading about the possibility of future blindness sent me over the edge and I panicked and started crying (I know, overreaction). I cried for maybe about 5 minutes and then when I checked again, the problem was gone. My vision seems normal right now. I can read off the screen with no issues. But the headache is still there.\nI should mention that my mother was diagnosed with macular degeneration and my aunt (father's sister) had retinal detachment. For the past year, I've been reading off computer screens much more than usual. For a while, I have had the suspicion that my vision is going down. I've been experiencing a bit of blurriness when looking at objects far away... sometimes I can't recognize faces of people who are standing maybe about 20 feet away. I've been meaning to go see a doctor but I can't right now because life is very hectic and stressful and it will be another month or so before I can find time to go. I'll also need to keep reading off computer screens for the next month at least.\nSo can anyone here tell me more about this? Why was it cured by tears? Is it okay if I wait another month before seeing a doctor? Should I completely avoid computer screens or is it okay if I read off them for a certain number of hours per day? \nThanks in advance! Apologies for any mistakes in my English; I'm not a native speaker. \n",
        "title": "Sudden Blurry Spot in Vision!",
        "topicId": "3mt8fg"
    },
    {
        "criteria": "Documents returned should discuss either the causes of, or appropriate investigations for, Stage 2 hypertension in a female. ",
        "description": "I am a 28 yo female, 5'10, 175 lbs. diagnosed w hypertension about six months ago, admitted to hospital in hypertensive crisis Friday night. 180/135. Cholesterol good, thyroid normal, EKG clear, heart ultrasound clear. Ear dr was surprised to learn that I've been on beta blockers for a few months, as apparently they tend to not work properly in women my age. Been getting blinding headaches and double vision. In addition to beta blockers, I take birth control, 20mg celexa, and 5000 iu vitamin D3 every day. Otherwise healthy. My primary says I'm probably just \"under stress\" as I have a special needs toddler. Ear doctor says hypertension to that degree doesn't occur idiopathically in women my age. My primary is an NP and doesn't seem to know what to do next. Please, any suggestions are welcome. Possible diagnoses, tests I should ask to have run, anything. I've been having horrible headaches and chest pain and no one seems to know why. Cape cod MA\n",
        "title": "My primary is at a loss, help please",
        "topicId": "2wwkq7"
    },
    {
        "criteria": "The document returned should contain information about or personal experience with surgery for an intermittently incarcerated inguinal hernia in a male. The document should discuss a laparoscopic or open repair, or compare the two. The document should particularly focus on the benefits of the operation and/ or the risks associated, information simply about an inguinal hernia and general information about treatment modalities is not appropriate in this case. If the document only discusses recurrence risk this should also be included. Although the size of the hernia may have implications for the repair, including this in the criteria for the document would likely overly restrict the results returned. ",
        "description": "I have a painful inguinal hernia that is really uncomfortable, with testicle pain and general nausea, limits activities quite a bit. It's tiny so you can't see it, a doc found with ultrasound. Anyway, I'll need surgery which I've never had before, and I'm terribly nervous as the Internet is filled with horror stories of complications. I'm debating laparoscopic with mesh, that seems to be the standard repair now for small hernias. \nCan anyone share their experience? What surgery type did you have? How was surgery and recovery? Did it resolve your hernia symptoms? Am I freaking out for no reason? Anything to know? Thanks!\n",
        "title": "Painful inguinal hernia, how is surgery? How's the outcome? Experiences welcome!",
        "topicId": "3431zx"
    },
    {
        "criteria": "The results returned should discuss recurrent occipital headaches in adolescents or young adults. The questioner highlights that donating blood relieves these headaches, so documents that highlight experiences with headaches related to iron storage disorders or red blood cell disorders should be included. Results that relate to complicating factors which would not occur in a male, such as use of the oral contraceptive pill or menorrhagia, should be excluded. Results that solely focus on low iron and/or haemochromatosis should be excluded. ",
        "description": "Hey doctors! I have had something going on for about 10 years now that has baffled every doctor I have ever seen. Maybe one of you could help. First, let me include my basic stuff.\n\nI am 22 years old.\nI am a male.\nI am roughly 6 feet tall.\nI am roughly 200 pounts (90.718474 kilograms).\nI am Caucasian. \nIssue has persisted ~10 years.\n\nSo anyway, I have had a weird issue of getting really wicked headaches. They are located at the base of the skull in the back, and the pain is on par with migraines. They do not seem to come with the nausea or sensitivity to sound or light, but rather seem to pop up by themselves. Nothing really seems to treat these headaches, with the exception of losing blood (typically by blood donation). A standard blood donation causes these headaches to go away for roughly 5 weeks, after which they will start to return.\nI do tend to have high iron contents, but I have tested negative for hemachromatosis. I am not really certain what else to even consider here.\nThanks in advance for your help, and maybe we can figure something out!\nAnd by all means, if you have questions, please ask away.\n-ndguardian\n",
        "title": "Headaches if I don't donate blood?",
        "topicId": "2k8lu4"
    },
    {
        "criteria": "The results should list causes of chest pain in a young female. Results that describe causes of \"heavy chest pain\" are the most appropriate, but limiting results based on this may find it difficult to find many results. ",
        "description": "Hey guys,\nI know you get plenty of questions about chest pain but, I really had to ask...\nI'm a 20year old female, active approx 3 times a week (running two and weight lifting the other), regular BMI (can't remember number but I know I'm in the \"normal zone\"), the only medical family history I have is my grandfather on my fathers side died in his 50s due to a stroke. Everyone else including my great grand parents have no history of cancers or dementia or any other genetic conditions...\nSo I've been getting chest pain and had it check out by the doctors. They've done all the right things and I've been on pariet (an Australian PPI I'm not sure if medication has the same names in America) as well as, a chest X-ray. The chest X-ray was as clear as day (I got it done after my chest infection) with no issues and the medication for heart burn is what I've been taking daily as per instructions. \nI'm still have chest pain, it was intermittent at first but has progressed to quite constant today. I had a constant productive cough (suspected chest infection) for two weeks with the occasional fever that has now cleared. So I went and got my X-ray because the pain is persistent and the results were clear. I've been taking pariet daily, stayed away from alcohol and spicy food as well just in case it really was heart burn, for just over two weeks now. \nI could directly point to the pain, it begins where my heart is, crosses to my right (approx to before my shoulder begins and in a straight line) and ends up hurting half way down my sternum. It's a heaviness feeling (occasionally stabbing), hurts more on inspiration and after an \"episode\" of sorts it settles to a persistent pain over my heart. \nAny advice would be wonderful. \nThank you very much! \n",
        "title": "Young person chest pain",
        "topicId": "37a7l0"
    },
    {
        "criteria": "Documents should discuss the risk factors for recurrent lower respiratory tract infections, including diseases that make an individual prone to recurrent infections. Information in the selected documents should be general in nature, and either list risk factors or explain a specific risk factor (e.g. an information pamphlet on HIV/AIDS or TB). ",
        "description": "First time I post to this sub! Hi! I could really appreciate some advice. I am a 23 year old otherwise healthy woman, physically. I run and eat healthy most of the time, I hardly ever drink anymore, and I stopped smoking a year ago. I was diagnosed (once again) with pneumonia this Sunday by a doctor. I recently had it last summer, and before that during the spring in 2014, which makes it 3 times in a row. This time and the last time were very painful to me. Last time it was so bad, it triggered a herpes infection outside and inside my right eye! I kinda feel like pneumonia has come to stay, and I am very afraid of it now, because of how painful and unpleasant it can be. \nI am wondering if I should see a doctor about it, so I can be examined and figure out why I have gotten it this many times already? The doctor I saw Sunday said that you are more prone to get it again if you've had before. If that's true, does this mean it's just a vicious cycle now? \nI lived in an apartment for two years which was very damp. Maybe that could have had an influence on my lungs? I moved out of it a year ago this April, though. My mom has asthma, but I don't think I have that. Pretty sure I don't.\nI would really appreciate your thoughts on this! English isn't my first language so sorry if there are any mistakes.\nThanks!\nEdit: words\nEdit 2: I have taken penicillin all 3 times. \n",
        "title": "I [23 F] have had pneumonia 3 times within a year. Should I be concerned?",
        "topicId": "2uo5qg"
    },
    {
        "criteria": "Documents should discuss the difference treatment options for chronic pain, specifically associated with fibromyalgia. ",
        "description": "So I'm a 30 yr old female. I'm 5'5\", 150 lbs, native american. Not much of that is relevant but that's fine. What is relevant is that I was diagnosed with fibromyalgia when I was 19, right after I had my daughter. It's become rather aggressive and \"mutated\" as my doctor put it. I was in pain management for ages because it's at a point that my doctor has hit a wall. Recently I had a young lady that I considered to be a close friend steal some of those pain meds. Unable to get refilled for a week, I went into withdraw. It was the worst thing I've ever had happen. It has more or less put me off being on opiates anymore if possible. However, the pain is horrific. By the end of the day I can barely walk without crying and some days start that way and stay like that all day. My knees, hips, shoulders and neck are the worst. I do my physical therapy stuff and then daily activities like work and groceries and whatever nonsense my daughter has going on, but nothing outside what I know I can take. \nThe question is this: are there any ways to relieve some of the unrelenting pain? My best friend manages a health and wellness store, so he has been talking to all his reps and bringing home armfuls of random supplements and stuff, but I thought I'd ask you guys/ladies if you had some tips.\nEdit: I should have specified that I have tried all the fibromyalgia approved treatments that are on the market. Nothing worked and opiates were a last resort.\n",
        "title": "Fibromyalgia pain relief without serious narcotics",
        "topicId": "3e9xbj"
    }
]